MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2680/mcu.h
// Register: B1D2
#define B1D2 B1D2
extern volatile unsigned char           B1D2                __at(0xE38);
#ifndef _LIB_BUILD
asm("B1D2 equ 0E38h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B1D20                  :1;
        unsigned B1D21                  :1;
        unsigned B1D22                  :1;
        unsigned B1D23                  :1;
        unsigned B1D24                  :1;
        unsigned B1D25                  :1;
        unsigned B1D26                  :1;
        unsigned B1D27                  :1;
    };
} B1D2bits_t;
extern volatile B1D2bits_t B1D2bits __at(0xE38);
// bitfield macros
#define _B1D2_B1D20_POSN                                    0x0
#define _B1D2_B1D20_POSITION                                0x0
#define _B1D2_B1D20_SIZE                                    0x1
#define _B1D2_B1D20_LENGTH                                  0x1
#define _B1D2_B1D20_MASK                                    0x1
#define _B1D2_B1D21_POSN                                    0x1
#define _B1D2_B1D21_POSITION                                0x1
#define _B1D2_B1D21_SIZE                                    0x1
#define _B1D2_B1D21_LENGTH                                  0x1
#define _B1D2_B1D21_MASK                                    0x2
#define _B1D2_B1D22_POSN                                    0x2
#define _B1D2_B1D22_POSITION                                0x2
#define _B1D2_B1D22_SIZE                                    0x1
#define _B1D2_B1D22_LENGTH                                  0x1
#define _B1D2_B1D22_MASK                                    0x4
#define _B1D2_B1D23_POSN                                    0x3
#define _B1D2_B1D23_POSITION                                0x3
#define _B1D2_B1D23_SIZE                                    0x1
#define _B1D2_B1D23_LENGTH                                  0x1
#define _B1D2_B1D23_MASK                                    0x8
#define _B1D2_B1D24_POSN                                    0x4
#define _B1D2_B1D24_POSITION                                0x4
#define _B1D2_B1D24_SIZE                                    0x1
#define _B1D2_B1D24_LENGTH                                  0x1
#define _B1D2_B1D24_MASK                                    0x10
#define _B1D2_B1D25_POSN                                    0x5
#define _B1D2_B1D25_POSITION                                0x5
#define _B1D2_B1D25_SIZE                                    0x1
#define _B1D2_B1D25_LENGTH                                  0x1
#define _B1D2_B1D25_MASK                                    0x20
#define _B1D2_B1D26_POSN                                    0x6
#define _B1D2_B1D26_POSITION                                0x6
#define _B1D2_B1D26_SIZE                                    0x1
#define _B1D2_B1D26_LENGTH                                  0x1
#define _B1D2_B1D26_MASK                                    0x40
#define _B1D2_B1D27_POSN                                    0x7
#define _B1D2_B1D27_POSITION                                0x7
#define _B1D2_B1D27_SIZE                                    0x1
#define _B1D2_B1D27_LENGTH                                  0x1
#define _B1D2_B1D27_MASK                                    0x80

// Register: B1D3
#define B1D3 B1D3
extern volatile unsigned char           B1D3                __at(0xE39);
#ifndef _LIB_BUILD
asm("B1D3 equ 0E39h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B1D30                  :1;
        unsigned B1D31                  :1;
        unsigned B1D32                  :1;
        unsigned B1D33                  :1;
        unsigned B1D34                  :1;
        unsigned B1D35                  :1;
        unsigned B1D36                  :1;
        unsigned B1D37                  :1;
    };
} B1D3bits_t;
extern volatile B1D3bits_t B1D3bits __at(0xE39);
// bitfield macros
#define _B1D3_B1D30_POSN                                    0x0
#define _B1D3_B1D30_POSITION                                0x0
#define _B1D3_B1D30_SIZE                                    0x1
#define _B1D3_B1D30_LENGTH                                  0x1
#define _B1D3_B1D30_MASK                                    0x1
#define _B1D3_B1D31_POSN                                    0x1
#define _B1D3_B1D31_POSITION                                0x1
#define _B1D3_B1D31_SIZE                                    0x1
#define _B1D3_B1D31_LENGTH                                  0x1
#define _B1D3_B1D31_MASK                                    0x2
#define _B1D3_B1D32_POSN                                    0x2
#define _B1D3_B1D32_POSITION                                0x2
#define _B1D3_B1D32_SIZE                                    0x1
#define _B1D3_B1D32_LENGTH                                  0x1
#define _B1D3_B1D32_MASK                                    0x4
#define _B1D3_B1D33_POSN                                    0x3
#define _B1D3_B1D33_POSITION                                0x3
#define _B1D3_B1D33_SIZE                                    0x1
#define _B1D3_B1D33_LENGTH                                  0x1
#define _B1D3_B1D33_MASK                                    0x8
#define _B1D3_B1D34_POSN                                    0x4
#define _B1D3_B1D34_POSITION                                0x4
#define _B1D3_B1D34_SIZE                                    0x1
#define _B1D3_B1D34_LENGTH                                  0x1
#define _B1D3_B1D34_MASK                                    0x10
#define _B1D3_B1D35_POSN                                    0x5
#define _B1D3_B1D35_POSITION                                0x5
#define _B1D3_B1D35_SIZE                                    0x1
#define _B1D3_B1D35_LENGTH                                  0x1
#define _B1D3_B1D35_MASK                                    0x20
#define _B1D3_B1D36_POSN                                    0x6
#define _B1D3_B1D36_POSITION                                0x6
#define _B1D3_B1D36_SIZE                                    0x1
#define _B1D3_B1D36_LENGTH                                  0x1
#define _B1D3_B1D36_MASK                                    0x40
#define _B1D3_B1D37_POSN                                    0x7
#define _B1D3_B1D37_POSITION                                0x7
#define _B1D3_B1D37_SIZE                                    0x1
#define _B1D3_B1D37_LENGTH                                  0x1
#define _B1D3_B1D37_MASK                                    0x80

// Register: B1D4
#define B1D4 B1D4
extern volatile unsigned char           B1D4                __at(0xE3A);
#ifndef _LIB_BUILD
asm("B1D4 equ 0E3Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B1D40                  :1;
        unsigned B1D41                  :1;
        unsigned B1D42                  :1;
        unsigned B1D43                  :1;
        unsigned B1D44                  :1;
        unsigned B1D45                  :1;
        unsigned B1D46                  :1;
        unsigned B1D47                  :1;
    };
} B1D4bits_t;
extern volatile B1D4bits_t B1D4bits __at(0xE3A);
// bitfield macros
#define _B1D4_B1D40_POSN                                    0x0
#define _B1D4_B1D40_POSITION                                0x0
#define _B1D4_B1D40_SIZE                                    0x1
#define _B1D4_B1D40_LENGTH                                  0x1
#define _B1D4_B1D40_MASK                                    0x1
#define _B1D4_B1D41_POSN                                    0x1
#define _B1D4_B1D41_POSITION                                0x1
#define _B1D4_B1D41_SIZE                                    0x1
#define _B1D4_B1D41_LENGTH                                  0x1
#define _B1D4_B1D41_MASK                                    0x2
#define _B1D4_B1D42_POSN                                    0x2
#define _B1D4_B1D42_POSITION                                0x2
#define _B1D4_B1D42_SIZE                                    0x1
#define _B1D4_B1D42_LENGTH                                  0x1
#define _B1D4_B1D42_MASK                                    0x4
#define _B1D4_B1D43_POSN                                    0x3
#define _B1D4_B1D43_POSITION                                0x3
#define _B1D4_B1D43_SIZE                                    0x1
#define _B1D4_B1D43_LENGTH                                  0x1
#define _B1D4_B1D43_MASK                                    0x8
#define _B1D4_B1D44_POSN                                    0x4
#define _B1D4_B1D44_POSITION                                0x4
#define _B1D4_B1D44_SIZE                                    0x1
#define _B1D4_B1D44_LENGTH                                  0x1
#define _B1D4_B1D44_MASK                                    0x10
#define _B1D4_B1D45_POSN                                    0x5
#define _B1D4_B1D45_POSITION                                0x5
#define _B1D4_B1D45_SIZE                                    0x1
#define _B1D4_B1D45_LENGTH                                  0x1
#define _B1D4_B1D45_MASK                                    0x20
#define _B1D4_B1D46_POSN                                    0x6
#define _B1D4_B1D46_POSITION                                0x6
#define _B1D4_B1D46_SIZE                                    0x1
#define _B1D4_B1D46_LENGTH                                  0x1
#define _B1D4_B1D46_MASK                                    0x40
#define _B1D4_B1D47_POSN                                    0x7
#define _B1D4_B1D47_POSITION                                0x7
#define _B1D4_B1D47_SIZE                                    0x1
#define _B1D4_B1D47_LENGTH                                  0x1
#define _B1D4_B1D47_MASK                                    0x80

// Register: B1D5
#define B1D5 B1D5
extern volatile unsigned char           B1D5                __at(0xE3B);
#ifndef _LIB_BUILD
asm("B1D5 equ 0E3Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B1D50                  :1;
        unsigned B1D51                  :1;
        unsigned B1D52                  :1;
        unsigned B1D53                  :1;
        unsigned B1D54                  :1;
        unsigned B1D55                  :1;
        unsigned B1D56                  :1;
        unsigned B1D57                  :1;
    };
} B1D5bits_t;
extern volatile B1D5bits_t B1D5bits __at(0xE3B);
// bitfield macros
#define _B1D5_B1D50_POSN                                    0x0
#define _B1D5_B1D50_POSITION                                0x0
#define _B1D5_B1D50_SIZE                                    0x1
#define _B1D5_B1D50_LENGTH                                  0x1
#define _B1D5_B1D50_MASK                                    0x1
#define _B1D5_B1D51_POSN                                    0x1
#define _B1D5_B1D51_POSITION                                0x1
#define _B1D5_B1D51_SIZE                                    0x1
#define _B1D5_B1D51_LENGTH                                  0x1
#define _B1D5_B1D51_MASK                                    0x2
#define _B1D5_B1D52_POSN                                    0x2
#define _B1D5_B1D52_POSITION                                0x2
#define _B1D5_B1D52_SIZE                                    0x1
#define _B1D5_B1D52_LENGTH                                  0x1
#define _B1D5_B1D52_MASK                                    0x4
#define _B1D5_B1D53_POSN                                    0x3
#define _B1D5_B1D53_POSITION                                0x3
#define _B1D5_B1D53_SIZE                                    0x1
#define _B1D5_B1D53_LENGTH                                  0x1
#define _B1D5_B1D53_MASK                                    0x8
#define _B1D5_B1D54_POSN                                    0x4
#define _B1D5_B1D54_POSITION                                0x4
#define _B1D5_B1D54_SIZE                                    0x1
#define _B1D5_B1D54_LENGTH                                  0x1
#define _B1D5_B1D54_MASK                                    0x10
#define _B1D5_B1D55_POSN                                    0x5
#define _B1D5_B1D55_POSITION                                0x5
#define _B1D5_B1D55_SIZE                                    0x1
#define _B1D5_B1D55_LENGTH                                  0x1
#define _B1D5_B1D55_MASK                                    0x20
#define _B1D5_B1D56_POSN                                    0x6
#define _B1D5_B1D56_POSITION                                0x6
#define _B1D5_B1D56_SIZE                                    0x1
#define _B1D5_B1D56_LENGTH                                  0x1
#define _B1D5_B1D56_MASK                                    0x40
#define _B1D5_B1D57_POSN                                    0x7
#define _B1D5_B1D57_POSITION                                0x7
#define _B1D5_B1D57_SIZE                                    0x1
#define _B1D5_B1D57_LENGTH                                  0x1
#define _B1D5_B1D57_MASK                                    0x80

// Register: B1D6
#define B1D6 B1D6
extern volatile unsigned char           B1D6                __at(0xE3C);
#ifndef _LIB_BUILD
asm("B1D6 equ 0E3Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B1D60                  :1;
        unsigned B1D61                  :1;
        unsigned B1D62                  :1;
        unsigned B1D63                  :1;
        unsigned B1D64                  :1;
        unsigned B1D65                  :1;
        unsigned B1D66                  :1;
        unsigned B1D67                  :1;
    };
} B1D6bits_t;
