MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2680/mcu.h
// Register: BRGCON3
#define BRGCON3 BRGCON3
extern volatile unsigned char           BRGCON3             __at(0xF72);
#ifndef _LIB_BUILD
asm("BRGCON3 equ 0F72h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG2PH0                :1;
        unsigned SEG2PH1                :1;
        unsigned SEG2PH2                :1;
        unsigned                        :3;
        unsigned WAKFIL                 :1;
        unsigned WAKDIS                 :1;
    };
} BRGCON3bits_t;
extern volatile BRGCON3bits_t BRGCON3bits __at(0xF72);
// bitfield macros
#define _BRGCON3_SEG2PH0_POSN                               0x0
#define _BRGCON3_SEG2PH0_POSITION                           0x0
#define _BRGCON3_SEG2PH0_SIZE                               0x1
#define _BRGCON3_SEG2PH0_LENGTH                             0x1
#define _BRGCON3_SEG2PH0_MASK                               0x1
#define _BRGCON3_SEG2PH1_POSN                               0x1
#define _BRGCON3_SEG2PH1_POSITION                           0x1
#define _BRGCON3_SEG2PH1_SIZE                               0x1
#define _BRGCON3_SEG2PH1_LENGTH                             0x1
#define _BRGCON3_SEG2PH1_MASK                               0x2
#define _BRGCON3_SEG2PH2_POSN                               0x2
#define _BRGCON3_SEG2PH2_POSITION                           0x2
#define _BRGCON3_SEG2PH2_SIZE                               0x1
#define _BRGCON3_SEG2PH2_LENGTH                             0x1
#define _BRGCON3_SEG2PH2_MASK                               0x4
#define _BRGCON3_WAKFIL_POSN                                0x6
#define _BRGCON3_WAKFIL_POSITION                            0x6
#define _BRGCON3_WAKFIL_SIZE                                0x1
#define _BRGCON3_WAKFIL_LENGTH                              0x1
#define _BRGCON3_WAKFIL_MASK                                0x40
#define _BRGCON3_WAKDIS_POSN                                0x7
#define _BRGCON3_WAKDIS_POSITION                            0x7
#define _BRGCON3_WAKDIS_SIZE                                0x1
#define _BRGCON3_WAKDIS_LENGTH                              0x1
#define _BRGCON3_WAKDIS_MASK                                0x80

// Register: CIOCON
#define CIOCON CIOCON
extern volatile unsigned char           CIOCON              __at(0xF73);
#ifndef _LIB_BUILD
asm("CIOCON equ 0F73h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned CANCAP                 :1;
        unsigned ENDRHI                 :1;
    };
} CIOCONbits_t;
extern volatile CIOCONbits_t CIOCONbits __at(0xF73);
// bitfield macros
#define _CIOCON_CANCAP_POSN                                 0x4
#define _CIOCON_CANCAP_POSITION                             0x4
#define _CIOCON_CANCAP_SIZE                                 0x1
#define _CIOCON_CANCAP_LENGTH                               0x1
#define _CIOCON_CANCAP_MASK                                 0x10
#define _CIOCON_ENDRHI_POSN                                 0x5
#define _CIOCON_ENDRHI_POSITION                             0x5
#define _CIOCON_ENDRHI_SIZE                                 0x1
#define _CIOCON_ENDRHI_LENGTH                               0x1
#define _CIOCON_ENDRHI_MASK                                 0x20

// Register: COMSTAT
#define COMSTAT COMSTAT
extern volatile unsigned char           COMSTAT             __at(0xF74);
#ifndef _LIB_BUILD
asm("COMSTAT equ 0F74h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :7;
        unsigned RXB0OVFL_NOT_FIFOEMPTY :1;
    };
    struct {
        unsigned EWARN                  :1;
        unsigned RXWARN                 :1;
        unsigned TXWARN                 :1;
        unsigned RXBP                   :1;
        unsigned TXBP                   :1;
        unsigned TXBO                   :1;
        unsigned RXBnOVFL               :1;
        unsigned RXB0OVFL_nFIFOEMPTY    :1;
    };
    struct {
        unsigned                        :6;
        unsigned RXB1OVFL               :1;
        unsigned RXB0OVFL               :1;
    };
    struct {
        unsigned                        :7;
        unsigned FIFOEMPTY              :1;
    };
    struct {
        unsigned                        :7;
        unsigned NOT_FIFOEMPTY          :1;
    };
    struct {
        unsigned                        :7;
        unsigned nFIFOEMPTY             :1;
    };
    struct {
        unsigned                        :6;
        unsigned RXBNOVFL               :1;
    };
} COMSTATbits_t;
extern volatile COMSTATbits_t COMSTATbits __at(0xF74);
// bitfield macros
#define _COMSTAT_RXB0OVFL_NOT_FIFOEMPTY_POSN                0x7
#define _COMSTAT_RXB0OVFL_NOT_FIFOEMPTY_POSITION            0x7
#define _COMSTAT_RXB0OVFL_NOT_FIFOEMPTY_SIZE                0x1
#define _COMSTAT_RXB0OVFL_NOT_FIFOEMPTY_LENGTH              0x1
#define _COMSTAT_RXB0OVFL_NOT_FIFOEMPTY_MASK                0x80
#define _COMSTAT_EWARN_POSN                                 0x0
#define _COMSTAT_EWARN_POSITION                             0x0
#define _COMSTAT_EWARN_SIZE                                 0x1
#define _COMSTAT_EWARN_LENGTH                               0x1
#define _COMSTAT_EWARN_MASK                                 0x1
#define _COMSTAT_RXWARN_POSN                                0x1
#define _COMSTAT_RXWARN_POSITION                            0x1
#define _COMSTAT_RXWARN_SIZE                                0x1
#define _COMSTAT_RXWARN_LENGTH                              0x1
#define _COMSTAT_RXWARN_MASK                                0x2
#define _COMSTAT_TXWARN_POSN                                0x2
#define _COMSTAT_TXWARN_POSITION                            0x2
#define _COMSTAT_TXWARN_SIZE                                0x1
#define _COMSTAT_TXWARN_LENGTH                              0x1
#define _COMSTAT_TXWARN_MASK                                0x4
#define _COMSTAT_RXBP_POSN                                  0x3
#define _COMSTAT_RXBP_POSITION                              0x3
#define _COMSTAT_RXBP_SIZE                                  0x1
#define _COMSTAT_RXBP_LENGTH                                0x1
#define _COMSTAT_RXBP_MASK                                  0x8
#define _COMSTAT_TXBP_POSN                                  0x4
#define _COMSTAT_TXBP_POSITION                              0x4
#define _COMSTAT_TXBP_SIZE                                  0x1
#define _COMSTAT_TXBP_LENGTH                                0x1
#define _COMSTAT_TXBP_MASK                                  0x10
#define _COMSTAT_TXBO_POSN                                  0x5
#define _COMSTAT_TXBO_POSITION                              0x5
#define _COMSTAT_TXBO_SIZE                                  0x1
#define _COMSTAT_TXBO_LENGTH                                0x1
#define _COMSTAT_TXBO_MASK                                  0x20
#define _COMSTAT_RXBnOVFL_POSN                              0x6
#define _COMSTAT_RXBnOVFL_POSITION                          0x6
#define _COMSTAT_RXBnOVFL_SIZE                              0x1
#define _COMSTAT_RXBnOVFL_LENGTH                            0x1
#define _COMSTAT_RXBnOVFL_MASK                              0x40
#define _COMSTAT_RXB0OVFL_nFIFOEMPTY_POSN                   0x7
#define _COMSTAT_RXB0OVFL_nFIFOEMPTY_POSITION               0x7
#define _COMSTAT_RXB0OVFL_nFIFOEMPTY_SIZE                   0x1
#define _COMSTAT_RXB0OVFL_nFIFOEMPTY_LENGTH                 0x1
#define _COMSTAT_RXB0OVFL_nFIFOEMPTY_MASK                   0x80
#define _COMSTAT_RXB1OVFL_POSN                              0x6
#define _COMSTAT_RXB1OVFL_POSITION                          0x6
#define _COMSTAT_RXB1OVFL_SIZE                              0x1
#define _COMSTAT_RXB1OVFL_LENGTH                            0x1
#define _COMSTAT_RXB1OVFL_MASK                              0x40
#define _COMSTAT_RXB0OVFL_POSN                              0x7
#define _COMSTAT_RXB0OVFL_POSITION                          0x7
#define _COMSTAT_RXB0OVFL_SIZE                              0x1
#define _COMSTAT_RXB0OVFL_LENGTH                            0x1
#define _COMSTAT_RXB0OVFL_MASK                              0x80
#define _COMSTAT_FIFOEMPTY_POSN                             0x7
#define _COMSTAT_FIFOEMPTY_POSITION                         0x7
#define _COMSTAT_FIFOEMPTY_SIZE                             0x1
#define _COMSTAT_FIFOEMPTY_LENGTH                           0x1
#define _COMSTAT_FIFOEMPTY_MASK                             0x80
#define _COMSTAT_NOT_FIFOEMPTY_POSN                         0x7
#define _COMSTAT_NOT_FIFOEMPTY_POSITION                     0x7
#define _COMSTAT_NOT_FIFOEMPTY_SIZE                         0x1
#define _COMSTAT_NOT_FIFOEMPTY_LENGTH                       0x1
#define _COMSTAT_NOT_FIFOEMPTY_MASK                         0x80
#define _COMSTAT_nFIFOEMPTY_POSN                            0x7
#define _COMSTAT_nFIFOEMPTY_POSITION                        0x7
#define _COMSTAT_nFIFOEMPTY_SIZE                            0x1
#define _COMSTAT_nFIFOEMPTY_LENGTH                          0x1
#define _COMSTAT_nFIFOEMPTY_MASK                            0x80
#define _COMSTAT_RXBNOVFL_POSN                              0x6
#define _COMSTAT_RXBNOVFL_POSITION                          0x6
#define _COMSTAT_RXBNOVFL_SIZE                              0x1
#define _COMSTAT_RXBNOVFL_LENGTH                            0x1
#define _COMSTAT_RXBNOVFL_MASK                              0x40

// Register: RXERRCNT
#define RXERRCNT RXERRCNT
extern volatile unsigned char           RXERRCNT            __at(0xF75);
#ifndef _LIB_BUILD
asm("RXERRCNT equ 0F75h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned REC0                   :1;
        unsigned REC1                   :1;
        unsigned REC2                   :1;
        unsigned REC3                   :1;
        unsigned REC4                   :1;
        unsigned REC5                   :1;
        unsigned REC6                   :1;
        unsigned REC7                   :1;
    };
} RXERRCNTbits_t;
extern volatile RXERRCNTbits_t RXERRCNTbits __at(0xF75);
// bitfield macros
#define _RXERRCNT_REC0_POSN                                 0x0
#define _RXERRCNT_REC0_POSITION                             0x0
#define _RXERRCNT_REC0_SIZE                                 0x1
#define _RXERRCNT_REC0_LENGTH                               0x1
#define _RXERRCNT_REC0_MASK                                 0x1
#define _RXERRCNT_REC1_POSN                                 0x1
#define _RXERRCNT_REC1_POSITION                             0x1
#define _RXERRCNT_REC1_SIZE                                 0x1
#define _RXERRCNT_REC1_LENGTH                               0x1
#define _RXERRCNT_REC1_MASK                                 0x2
#define _RXERRCNT_REC2_POSN                                 0x2
#define _RXERRCNT_REC2_POSITION                             0x2
#define _RXERRCNT_REC2_SIZE                                 0x1
#define _RXERRCNT_REC2_LENGTH                               0x1
#define _RXERRCNT_REC2_MASK                                 0x4
#define _RXERRCNT_REC3_POSN                                 0x3
#define _RXERRCNT_REC3_POSITION                             0x3
#define _RXERRCNT_REC3_SIZE                                 0x1
#define _RXERRCNT_REC3_LENGTH                               0x1
#define _RXERRCNT_REC3_MASK                                 0x8
#define _RXERRCNT_REC4_POSN                                 0x4
#define _RXERRCNT_REC4_POSITION                             0x4
#define _RXERRCNT_REC4_SIZE                                 0x1
#define _RXERRCNT_REC4_LENGTH                               0x1
#define _RXERRCNT_REC4_MASK                                 0x10
#define _RXERRCNT_REC5_POSN                                 0x5
#define _RXERRCNT_REC5_POSITION                             0x5
#define _RXERRCNT_REC5_SIZE                                 0x1
#define _RXERRCNT_REC5_LENGTH                               0x1
#define _RXERRCNT_REC5_MASK                                 0x20
#define _RXERRCNT_REC6_POSN                                 0x6
#define _RXERRCNT_REC6_POSITION                             0x6
#define _RXERRCNT_REC6_SIZE                                 0x1
#define _RXERRCNT_REC6_LENGTH                               0x1
#define _RXERRCNT_REC6_MASK                                 0x40
#define _RXERRCNT_REC7_POSN                                 0x7
#define _RXERRCNT_REC7_POSITION                             0x7
#define _RXERRCNT_REC7_SIZE                                 0x1
#define _RXERRCNT_REC7_LENGTH                               0x1
#define _RXERRCNT_REC7_MASK                                 0x80

// Register: TXERRCNT
#define TXERRCNT TXERRCNT
extern volatile unsigned char           TXERRCNT            __at(0xF76);
#ifndef _LIB_BUILD
asm("TXERRCNT equ 0F76h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TEC0                   :1;
        unsigned TEC1                   :1;
        unsigned TEC2                   :1;
        unsigned TEC3                   :1;
        unsigned TEC4                   :1;
        unsigned TEC5                   :1;
        unsigned TEC6                   :1;
        unsigned TEC7                   :1;
    };
} TXERRCNTbits_t;
extern volatile TXERRCNTbits_t TXERRCNTbits __at(0xF76);
// bitfield macros
#define _TXERRCNT_TEC0_POSN                                 0x0
#define _TXERRCNT_TEC0_POSITION                             0x0
#define _TXERRCNT_TEC0_SIZE                                 0x1
#define _TXERRCNT_TEC0_LENGTH                               0x1
#define _TXERRCNT_TEC0_MASK                                 0x1
#define _TXERRCNT_TEC1_POSN                                 0x1
#define _TXERRCNT_TEC1_POSITION                             0x1
#define _TXERRCNT_TEC1_SIZE                                 0x1
#define _TXERRCNT_TEC1_LENGTH                               0x1
#define _TXERRCNT_TEC1_MASK                                 0x2
#define _TXERRCNT_TEC2_POSN                                 0x2
#define _TXERRCNT_TEC2_POSITION                             0x2
#define _TXERRCNT_TEC2_SIZE                                 0x1
#define _TXERRCNT_TEC2_LENGTH                               0x1
#define _TXERRCNT_TEC2_MASK                                 0x4
#define _TXERRCNT_TEC3_POSN                                 0x3
#define _TXERRCNT_TEC3_POSITION                             0x3
#define _TXERRCNT_TEC3_SIZE                                 0x1
#define _TXERRCNT_TEC3_LENGTH                               0x1
#define _TXERRCNT_TEC3_MASK                                 0x8
#define _TXERRCNT_TEC4_POSN                                 0x4
#define _TXERRCNT_TEC4_POSITION                             0x4
#define _TXERRCNT_TEC4_SIZE                                 0x1
#define _TXERRCNT_TEC4_LENGTH                               0x1
#define _TXERRCNT_TEC4_MASK                                 0x10
#define _TXERRCNT_TEC5_POSN                                 0x5
#define _TXERRCNT_TEC5_POSITION                             0x5
#define _TXERRCNT_TEC5_SIZE                                 0x1
#define _TXERRCNT_TEC5_LENGTH                               0x1
#define _TXERRCNT_TEC5_MASK                                 0x20
#define _TXERRCNT_TEC6_POSN                                 0x6
#define _TXERRCNT_TEC6_POSITION                             0x6
#define _TXERRCNT_TEC6_SIZE                                 0x1
#define _TXERRCNT_TEC6_LENGTH                               0x1
#define _TXERRCNT_TEC6_MASK                                 0x40
#define _TXERRCNT_TEC7_POSN                                 0x7
#define _TXERRCNT_TEC7_POSITION                             0x7
#define _TXERRCNT_TEC7_SIZE                                 0x1
#define _TXERRCNT_TEC7_LENGTH                               0x1
#define _TXERRCNT_TEC7_MASK                                 0x80

// Register: ECANCON
#define ECANCON ECANCON
extern volatile unsigned char           ECANCON             __at(0xF77);
#ifndef _LIB_BUILD
asm("ECANCON equ 0F77h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EWIN0                  :1;
        unsigned EWIN1                  :1;
        unsigned EWIN2                  :1;
        unsigned EWIN3                  :1;
        unsigned EWIN4                  :1;
        unsigned FIFOWM                 :1;
        unsigned MDSEL0                 :1;
        unsigned MDSEL1                 :1;
    };
    struct {
        unsigned                        :5;
        unsigned F                      :1;
    };
} ECANCONbits_t;
extern volatile ECANCONbits_t ECANCONbits __at(0xF77);
// bitfield macros
#define _ECANCON_EWIN0_POSN                                 0x0
#define _ECANCON_EWIN0_POSITION                             0x0
#define _ECANCON_EWIN0_SIZE                                 0x1
#define _ECANCON_EWIN0_LENGTH                               0x1
#define _ECANCON_EWIN0_MASK                                 0x1
#define _ECANCON_EWIN1_POSN                                 0x1
#define _ECANCON_EWIN1_POSITION                             0x1
#define _ECANCON_EWIN1_SIZE                                 0x1
#define _ECANCON_EWIN1_LENGTH                               0x1
#define _ECANCON_EWIN1_MASK                                 0x2
#define _ECANCON_EWIN2_POSN                                 0x2
#define _ECANCON_EWIN2_POSITION                             0x2
#define _ECANCON_EWIN2_SIZE                                 0x1
#define _ECANCON_EWIN2_LENGTH                               0x1
#define _ECANCON_EWIN2_MASK                                 0x4
#define _ECANCON_EWIN3_POSN                                 0x3
#define _ECANCON_EWIN3_POSITION                             0x3
#define _ECANCON_EWIN3_SIZE                                 0x1
#define _ECANCON_EWIN3_LENGTH                               0x1
#define _ECANCON_EWIN3_MASK                                 0x8
#define _ECANCON_EWIN4_POSN                                 0x4
#define _ECANCON_EWIN4_POSITION                             0x4
#define _ECANCON_EWIN4_SIZE                                 0x1
#define _ECANCON_EWIN4_LENGTH                               0x1
#define _ECANCON_EWIN4_MASK                                 0x10
#define _ECANCON_FIFOWM_POSN                                0x5
#define _ECANCON_FIFOWM_POSITION                            0x5
#define _ECANCON_FIFOWM_SIZE                                0x1
#define _ECANCON_FIFOWM_LENGTH                              0x1
#define _ECANCON_FIFOWM_MASK                                0x20
#define _ECANCON_MDSEL0_POSN                                0x6
#define _ECANCON_MDSEL0_POSITION                            0x6
#define _ECANCON_MDSEL0_SIZE                                0x1
#define _ECANCON_MDSEL0_LENGTH                              0x1
#define _ECANCON_MDSEL0_MASK                                0x40
#define _ECANCON_MDSEL1_POSN                                0x7
#define _ECANCON_MDSEL1_POSITION                            0x7
#define _ECANCON_MDSEL1_SIZE                                0x1
#define _ECANCON_MDSEL1_LENGTH                              0x1
#define _ECANCON_MDSEL1_MASK                                0x80
#define _ECANCON_F_POSN                                     0x5
#define _ECANCON_F_POSITION                                 0x5
#define _ECANCON_F_SIZE                                     0x1
#define _ECANCON_F_LENGTH                                   0x1
#define _ECANCON_F_MASK                                     0x20

// Register: PORTA
#define PORTA PORTA
extern volatile unsigned char           PORTA               __at(0xF80);
#ifndef _LIB_BUILD
asm("PORTA equ 0F80h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0                    :1;
        unsigned RA1                    :1;
        unsigned RA2                    :1;
        unsigned RA3                    :1;
        unsigned RA4                    :1;
        unsigned RA5                    :1;
        unsigned RA6                    :1;
        unsigned RA7                    :1;
    };
    struct {
        unsigned AN0                    :1;
        unsigned AN1                    :1;
        unsigned AN2                    :1;
        unsigned AN3                    :1;
        unsigned T0CKI                  :1;
        unsigned AN4                    :1;
        unsigned OSC2                   :1;
        unsigned OSC1                   :1;
    };
    struct {
        unsigned CVREF                  :1;
        unsigned                        :1;
        unsigned VREFM                  :1;
        unsigned VREFP                  :1;
        unsigned                        :1;
        unsigned HLVDIN                 :1;
        unsigned CLKO                   :1;
        unsigned CLKI                   :1;
    };
    struct {
        unsigned                        :5;
        unsigned LVDIN                  :1;
    };
    struct {
        unsigned                        :5;
        unsigned SS                     :1;
    };
    struct {
        unsigned                        :5;
        unsigned NOT_SS                 :1;
    };
    struct {
        unsigned                        :5;
        unsigned nSS                    :1;
    };
    struct {
        unsigned ULPWUIN                :1;
        unsigned                        :6;
        unsigned RJPU                   :1;
    };
} PORTAbits_t;
